const validate = {
  // 用户账号规则
  usernameRule: [
    /^[a-zA-Z]{1}([a-zA-Z0-9]|[._]){5,20}$/,
    '账号只能输入6-20个以字母开头、可带数字、“_”、“.”的字串'
  ],
  // 开放平台账户密码规则
  passwordRule: [
    /^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?!([^(0-9a-zA-Z)])+$).{6,20}$/,
    '密码长度为6到20位，只能输入数字、字母、特殊字符组合中至少两种'
  ],
  // 电话规则
  phoneRule: [
    /^1((3[\d])|(4[5,6,7,9])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[\d])|(9[1,8,9]))\d{8}$/,
    '手机号格式输入不正确'
  ],
  // 邮箱规则
  emailRule: [
    /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
    '邮箱格式输入不正确'
  ],
  maxLength: [
    /^.{0,50}$/,
    '不能超过50个字符'
  ],
  max300Length: [
    /^.{0,300}$/,
    '不能超过300个字符'
  ],
  docVersion: [
    /^[0-9]\d?(\.(0|[1-9]\d?)){2}$/,
    '版本号格式不正确'
  ]
}
export default validate
